Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>VAHEJiQ8R4hBUkhO4WuKEuZ0H4pRsXq46UgaI1JbxtkOY/0bdamN232Uxb/JLlUURSuglUehZztP&#13;
2MXQYC86KxBj0bJ/fbsS1gjh+pd0BEhRwBE1jsid32Tr19B2y2LtlGgWIFbrl8f2MDssWYIXp49A&#13;
v2J9QZS9w4VmrVm5nQM=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>khJhdNbV2t6JVe3r6A7MKnbeHAKx0tHz4iYD8YiCqcMy9Ti6fPYJDU5QlA7ALie5wlMAz0Ko+NM/&#13;
U7hTLFVkol1YmeqUxDcGb3G1acCxI/pBs1cOD2JHilPLi/I0Jp+7AEr2u0jAngpqaPIEX4C76Dk/&#13;
BdRDbb4dWa9r5iUWpJJoWLweJZETX9uwpCgr5ZMQRGlnHF57RBxtzitZEoM/gDvJd/Yhjf3agmJg&#13;
F8tRP9TA4r0sRV+EFxuE2T3F8uKT3MchGEFAijcc4yff31J/33l59WwlRHTD61yTOJP4RYgP3l4j&#13;
WhhQbPyu3oFzkUzdJGwIQw5P2x4XJjHC9sJ/df0gisYWctSlH+OV7sAzufoQKNgv56+Y4p25DK7I&#13;
NFQqbHsle4EJTA4iNrL9XEXlg8WaRn1Xr13D+rQzQ8i0jsl7AhL00OMncuSnJsgjkifGGWWDKNw+&#13;
qnNiDLmkmIAP6W/ec4dVIP0Tzm3QKONuOU+ZkwxuFiwI+6PNEoF0pqQ/6pDwexmuFmehpclVMz30&#13;
rxCG/hDHUGtx32/RSGqWg90HeE1jMjeUZskZ++04z7fXZ8anMr71Rad+t2J4Ic7c0gWyOXkpwgbw&#13;
xZD/82ntk2D8ljlOermt/HAXQuQMWBXNuWw21QpFsH8kO3i2bQbey7F6gAjLAl1aJQiZOeEa/EDw&#13;
hMWm9ucCWa2DYzFGIM4NxKe4oyhkWqTUZT3T2UdbiCph+Sv+kdDpuUvmNkYUKg+y3lM83zhMGt8m&#13;
U7waudNyggDknUXd7NsDnyZir6oAvYjNzzsF1+OXfMiplbzk0JxsIXtk0UbikGjimriBWwYLYvo9&#13;
cqu8BL0WBH5OplDzuWISqazprJWzlQMbPQ2hb02EX1LMxkrwQWHAOeJK6QNyNtmxFBmCO+2AldyY&#13;
+JqYVwf01inIL8Qa+l+yK99QafnJvXrwN6B+O4HQ+0RSUQTb</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>G/sze+8p2dTdOgWaEbwcUSZvESM=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
jGaOvit8a4KmPhWZ2X6fmRWW6a9gmtv3iyErB67idAK8oqT6zn8mCcA8GpIN2mB5EZ/dtCXU9HmU&#13;
Z8yUcucyD3JPpmUmiuf1wP+cs4GtAISAzChXoEqaWbkkdWl4pqBljilRCxJHOmPMKKLVeY+rBdD+&#13;
5G+t+5bvtKd3TEvTRjs=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>